a = int(input("Первое число: ", ))#Первое задание
b = int(input("Второе число: ", ))
c = int(input("Третье число: ", ))
print("Сумма всех чисел: ",a+b+c)
print()
A = int(input("Зарплата за месяц: ",))#Второе задание
B = int(input("Сумма месячного платежа по кредиту в банке: ",))
C = int(input("Задолженность за коммунальные услуги: ",))
print("Чистая прибыль: ",A-B-C)
print()
D = int(input("Длина первой диагонали ромба: ",))#Третье задание
E = int(input("Длина второй диагонали ромба: ",))
print("Площадь ромба: ",D*E/2)